app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2019-01-05 18:25:40.520701"], ["updated_at", "2019-01-05 18:25:40.520701"], ["artist_id", 138]]
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-01-05 18:25:40.518993"], ["updated_at", "2019-01-05 18:25:40.518993"]]
UPDATE "songs" SET "updated_at" = ?, "artist_id" = ? WHERE "songs"."id" = ?  [["updated_at", "2019-01-05 18:36:32.647641"], ["artist_id", 138], ["id", 188]]
---
  def upload
    CSV.foreach(params[:file].path, headers: true) do |info|
      # Artist.create(name: song[1])
      song = Song.create(title: info[0])
      song.artist_name = info[1]
      song.save